---
kind: property
id: P:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Size
source: html/0f62b6e9-cee1-5552-2751-f7d1087bc8c5.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Size Property

Returns the number of DistributionSys types that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```